/*
 * 프로그램명 : 자바 기초 문법
 * 작성자 : 박찬우
 * 작성일 : 20190218
 * 프로그램기능 : 자바 기초 문법 설명1
 */

//패키지
//-> 폴더명과 일치
//-> 클래스 여러개 구성 가능
//-> 구성원을 하나로 묶어주는 팀 역할
package javase_20190218;

//클래스 
//-> 파일명과 일치
//-> 클래스명 첫 글자는 대문자
//-> 자바 프로그램의 최소 단위
//-> 팀 안에 구성된 구성원 역할
public class Program005 {
	
	//메소드
	//-> 클래스 내부에서 액션 담당
	//-> 팀 안에 구성된 구성원의 담당 역할
	
	//main() 메소드는 특수한 목적을 가진 메소드(단독 실행 가능) 
	//-> 팀장 역할
	public static void main(String[] args) {
		
		//프로그램 코드
		//-> 실행문;
		//-> 변수 사용은 선언 후에 사용 가능
		//-> 적절한 들여쓰기 필수
		
		//변수 선언
		//-> 의미있는 단어 사용
		int a;
		int b;
		
		//변수 사용
		a = 10;
		b = 20;
	}

}